# language: ru
Функционал: 5_Лайв, Прематч и динамическое меню

  @regress
  @BurgerMenu_C1064
  Сценарий: Бургер-меню. Переход по всем разделам.

    * разлогиниваем пользователя
    * открывается страница "Главная страница"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Лайв"
    * открывается страница "Лайв"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Прематч"
    * открывается страница "Прематч"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "События дня"
    * открывается страница "События дня"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Лайв-обзор"
    * открывается страница "Лайв-обзор"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Мультимонитор"
    * открывается страница "Мультимонитор"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Новости"
    * открывается страница "Новости"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Результаты"
    * открывается страница "Результаты"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "ЦУПИС"
    * открывается страница "ЦУПИС"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Супербет"
    * открывается страница "Супербет"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Тарифы"
    * открывается страница "Тарифы"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Как пополнить баланс"
    * открывается страница "Как пополнить баланс"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Как начать пари"
    * открывается страница "Как начать пари"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Как получить выйгрыш"
    * открывается страница "Основные положения"

    * пользователь (проверяет, что перешел именно по ссылке Как получить выйгрыш)
    * пользователь (нажимает кнопку) "Бургер"

    * открывается страница "Бургер"
    * пользователь (нажимает кнопку) "Фрибет"

    * открывается страница "Фрибет"
    * пользователь (нажимает кнопку) "Бургер"

    * открывается страница "Бургер"
    * пользователь (нажимает кнопку) "Бонусы"

    * открывается страница "Бонусы"
    * пользователь (нажимает кнопку) "Бургер"

    * открывается страница "Бургер"
    * (stop)
    * пользователь (нажимает кнопку) "Правила"

    * открывается страница "Основные положения"
    * пользователь (нажимает кнопку) "Бургер"

    * открывается страница "Бургер"
    * пользователь (нажимает кнопку) "Приложения для iOS и Android"

    * открывается страница "Приложения для iOS и Android"
    * пользователь (нажимает кнопку) "Бургер"

    * открывается страница "Бургер"
    * пользователь (нажимает кнопку) "Часто задаваемые вопросы"

    * открывается страница "Регистрация и заключение пари"
    * пользователь (нажимает кнопку) "Бургер"

    * открывается страница "Бургер"
    * пользователь (нажимает кнопку) "Онлайн-чат"

    * открывается страница "Онлайн-чат"
    * пользователь (нажимает кнопку) "Свернуть"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Онлайн-чат"
    * открывается страница "Онлайн-чат"

    * пользователь (нажимает кнопку) "Свернуть"
    * пользователь (нажимает кнопку) "Бургер"

    * открывается страница "Бургер"
    * пользователь (нажимает кнопку) "Онлайн-чат"

    * открывается страница "Онлайн-чат"
    * пользователь (нажимает кнопку) "Свернуть"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Статистика"
    * открывается страница "Статистика"

    * закрываем браузер