# language: ru
Функционал: 6_Статические страницы

  @regress
  @LandingAppDownload_C1075
  Сценарий: Проверка скачивания мобильного приложения со страницы лендинга-app.

    * переходит на главную страницу
    * открывается страница "Главная страница"
    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"
    * пользователь (нажимает кнопку) "Приложения для iOS и Android"

    * открывается страница "Приложения для iOS и Android"
    * пользователь (проверяет скачивание приложения на ios)
    * пользователь (проверяет скачивание приложения на android)

    * (закрываем браузер)


