# language: ru
Функционал: 6_Статические страницы

  @regress
  @LandingAppDownload_C1065
  Сценарий: Проверка скачивания мобильного приложения со страницы лендинга-app.

    * разлогиниваем пользователя
    * открывается страница "Главная страница"

    * пользователь (нажимает кнопку) "Бургер"
    * открывается страница "Бургер"

    * пользователь (нажимает кнопку) "Приложения для iOS и Android"
    * открывается страница "Приложения для iOS и Android"

    * пользователь (проверяет скачивание приложения на ios)
    * пользователь (проверяет скачивание приложения на android)

    * закрываем браузер


